{
  "id": "6030212f-4ee0-4a9b-94cd-d6c773af7dd0",
  "slug": "civil-aviation-academy-of-the-republic-of-kazakhstan",
  "name": "Civil Aviation Academy of the Republic of Kazakhstan",
  "continent": "Asia",
  "country": "Kazakhstan",
  "state": "KAZ",
  "city": "",
  "baseAirport": "",
  "website": "https://caa.edu.kz/",
  "email": "info@agakaz.kz",
  "phone": "'+7 (702) 024-45-12",
  "about": "The Civil Aviation Academy of the Republic of Kazakhstan, established in 1995 in Almaty, is the leading institution for training aviation specialists in Kazakhstan and Central Asia. It operates under the Ministry of Science and Higher Education and adheres to international standards set by ICAO, EASA, and IATA. The academy offers undergraduate and master's programs in aviation engineering, flight operations, and transportation management, with a focus on practical training using advanced simulators and real flying equipment. It also includes specialized centers for aviation security, aircraft maintenance, and pilot training. The academy's mission is to deliver high-quality educational services, preparing universal personnel for various industries, including civil aviation, mechanical engineering, and security agencies. With a strong emphasis on practice and individual approach, the academy ensures its graduates are in high demand globally.",
  "icao": "",
  "iata": "",
  "rating": null,
  "ratingsNumber": null,
  "services": "[\"AVIATION SECURITY\\\" FOR AIRLINE (AIRPORT) GROUND HANDLING PERSONNEL INVOLVED IN THE CHECK-IN AND PASSENGER SERVICE PROCESS. MODULE 1\",6,\"9\\nAVIATION SECURITY\\\" FOR NON-SUB PERSONNEL WHO HAVE UNACCOMPANIED ACCESS TO THE CONTROLLED AREA OF THE AIRPORT (AIRPORT TENANTS AND OTHERS). MODULE 1\\nAVIATION SECURITY\\\" FOR PERSONNEL INVOLVED IN BAGGAGE HANDLING\\nAVIATION LEGISLATION\\nAVIATION PROFILING\\nBasic Aviation Security Course\\nFLIGHT SUPPORT STAFF TRAINING/FLIGHT DISPATCHER/FLIGHT DISPATCHER\\nGROUND HANDLING MANAGEMENT\\nGROUND HANDLING OF AIRCRAFT\\nGROUND HANDLING OF PASSENGERS\\nHEADS OF AVIATION SECURITY SERVICES\\nMIDDLE MANAGERS OF AIRPORT SECURITY SERVICES\"]",
  "visaInsurance": "",
  "fleetSize": "",
  "logoUrl": ""
}