{
  "id": "23f50203-b2e2-4b04-aee9-9da16f7481ca",
  "slug": "thai-flight-training-co-ltd-tft",
  "name": "Thai Flight Training Co., Ltd. (TFT)",
  "continent": "Asia",
  "country": "Thailand",
  "state": "TH",
  "city": "",
  "baseAirport": "",
  "website": "https://www.tft.co.th/",
  "email": "",
  "phone": "02-545-3082",
  "about": "Thai Flight Training Co., Ltd. (TFT) is a premier flight school dedicated to fostering excellence in aviation education. Located in Thailand, TFT utilizes state-of-the-art facilities and modern aircraft, such as the TECNAM P2006T and Cessna 172, to provide comprehensive training. Our curriculum, aligned with international standards, includes Private Pilot License (PPL), Commercial Pilot License (CPL), and Instrument Rating courses. With experienced instructors and a safe, less congested training environment, TFT prepares students for a lifelong career in aviation. Our campuses, strategically situated near airports like Phitsanulok and Roi Et, offer convenient access to navigation facilities and diverse flight training opportunities. TFT is committed to providing a supportive and productive learning environment, ensuring our students are well-equipped for the demands of a global aviation career. We strive to make every student a skilled and confident pilot.",
  "icao": "",
  "iata": "",
  "rating": null,
  "ratingsNumber": null,
  "services": "[\"CAAT Approved Training Courses\\nMulti Crew Co-Operation Course (Airline Pilot Standard)\\nMulti Crew Co-Operation Course (Airline Pilot Standard)\\nAirline Transport Pilot Knowledge\\nUpset Prevention and Recovery Training (UPRT)\\nExaminer Standardization\\nA320 Type Rating Training\\nA330 Type Rating Training\\nA737-400 Type Rating Training\\nB737-800 Type Rating Training\\nB777 Type Rating Training\\nAviation Training Courses\\nSafety Management Systems (SMS)\\nAVSEC Training course\\nDangerous Goods Regulations (DGR) course\\nHuman Factors (HF)\\nCrew resource management (CRM)\\nIn-flight service course\"]",
  "visaInsurance": "",
  "fleetSize": "",
  "logoUrl": ""
}